; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype fridgetype microwavetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   shelftype garbagecantype sidetabletype tvstandtype bathtubbasintype - receptacletype
   potatotype dishspongetype soapbottletype cuptype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 - location
   shelf_1 garbagecan_2 sidetable_3 tvstand_4 bathtubbasin_5 microwave_6 fridge_7 - receptacle
   potato_1 dishsponge_2 dishsponge_3 soapbottle_4 cup_5 - obj
 )
 (:init (receptacletype_0 shelf_1 shelftype) (receptacletype_0 garbagecan_2 garbagecantype) (receptacletype_0 sidetable_3 sidetabletype) (receptacletype_0 tvstand_4 tvstandtype) (receptacletype_0 bathtubbasin_5 bathtubbasintype) (receptacletype_0 microwave_6 microwavetype) (receptacletype_0 fridge_7 fridgetype) (objecttype_0 potato_1 potatotype) (objecttype_0 dishsponge_2 dishspongetype) (objecttype_0 dishsponge_3 dishspongetype) (objecttype_0 soapbottle_4 soapbottletype) (objecttype_0 cup_5 cuptype) (cancontain shelftype dishspongetype) (cancontain shelftype soapbottletype) (cancontain shelftype cuptype) (cancontain garbagecantype potatotype) (cancontain garbagecantype dishspongetype) (cancontain garbagecantype soapbottletype) (cancontain sidetabletype potatotype) (cancontain sidetabletype dishspongetype) (cancontain sidetabletype soapbottletype) (cancontain sidetabletype cuptype) (cancontain bathtubbasintype dishspongetype) (cancontain microwavetype potatotype) (cancontain microwavetype cuptype) (cancontain fridgetype potatotype) (cancontain fridgetype cuptype) (pickupable potato_1) (cleanable potato_1) (heatable potato_1) (coolable potato_1) (sliceable potato_1) (pickupable dishsponge_2) (cleanable dishsponge_2) (pickupable dishsponge_3) (cleanable dishsponge_3) (pickupable soapbottle_4) (pickupable cup_5) (isreceptacleobject cup_5) (cleanable cup_5) (heatable cup_5) (coolable cup_5) (receptacleatlocation shelf_1 location3) (receptacleatlocation garbagecan_2 location2) (receptacleatlocation sidetable_3 location3) (receptacleatlocation tvstand_4 location1) (receptacleatlocation bathtubbasin_5 location3) (receptacleatlocation microwave_6 location3) (receptacleatlocation fridge_7 location1) (inreceptacle potato_1 fridge_7) (inreceptacle dishsponge_2 bathtubbasin_5) (inreceptacle dishsponge_3 sidetable_3) (inreceptacle soapbottle_4 shelf_1) (inreceptacle cup_5 microwave_6) (objectatlocation potato_1 location1) (objectatlocation dishsponge_2 location3) (objectatlocation dishsponge_3 location3) (objectatlocation soapbottle_4 location3) (objectatlocation cup_5 location3) (atlocation agent1 location2) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o_0 - obj)
 (and (coolable ?o_0) (objecttype_0 ?o_0 potatotype) (receptacletype_0 ?r_0 microwavetype) (iscool ?o_0) (inreceptacle ?o_0 ?r_0))))))
 (:constraints (sometime (or (atlocation agent1 location4) (checked location5))) (sometime (holds agent1 potato_1)) (sometime-before (holds agent1 potato_1) (holds agent1 dishsponge_3)) (sometime (or (checked cup_5) (objectatlocation dishsponge_2 location2))) (sometime (objectatlocation potato_1 location3)) (sometime-before (objectatlocation potato_1 location3) (or (checked agent1) (checked location1))) (sometime (atlocation agent1 location3)) (sometime-before (atlocation agent1 location3) (checked location5)) (sometime (atlocation agent1 location1)) (sometime-after (atlocation agent1 location1) (objectatlocation dishsponge_3 location2)) (sometime (checked microwave_6)))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location2 location5)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location5)
   goals met: 0 of 1
2. (look agent1 location5)
   added: (checked location5)
   goals met: 0 of 1
3. (gotolocation agent1 location5 location3)
   deleted: (atlocation agent1 location5)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
4. (pickupobject agent1 location3 dishsponge_3 sidetable_3)
   deleted: (inreceptacle dishsponge_3 sidetable_3) (objectatlocation dishsponge_3 location3)
   added: (holds agent1 dishsponge_3) (holdsany agent1)
   goals met: 0 of 1
5. (examinereceptacle agent1 microwave_6)
   added: (checked microwave_6)
   goals met: 0 of 1
6. (examineobject agent1 cup_5)
   added: (checked cup_5)
   goals met: 0 of 1
7. (gotolocation agent1 location3 location2)
   deleted: (atlocation agent1 location3)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
8. (putobject agent1 location2 dishsponge_3 garbagecan_2 dishspongetype garbagecantype)
   deleted: (holds agent1 dishsponge_3) (holdsany agent1)
   added: (inreceptacle dishsponge_3 garbagecan_2) (objectatlocation dishsponge_3 location2)
   goals met: 0 of 1
9. (gotolocation agent1 location2 location1)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
10. (pickupobject agent1 location1 potato_1 fridge_7)
   deleted: (inreceptacle potato_1 fridge_7) (objectatlocation potato_1 location1)
   added: (holds agent1 potato_1) (holdsany agent1)
   goals met: 0 of 1
11. (help agent1)
   added: (checked agent1)
   goals met: 0 of 1
12. (coolobject agent1 location1 fridge_7 potato_1)
   added: (iscool potato_1)
   goals met: 0 of 1
13. (gotolocation agent1 location1 location3)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
14. (putobject agent1 location3 potato_1 microwave_6 potatotype microwavetype)
   deleted: (holds agent1 potato_1) (holdsany agent1)
   added: (inreceptacle potato_1 microwave_6) (objectatlocation potato_1 location3)
   goals met: 1 of 1
